Poorn-Mehta/ESA/ESM_Labs/Lab3_Rotary_Encoder_POT.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "LCD.h"
#include "QuadDec_1.h"
#include "Clock_1.h"
#include "ADC_SAR_1.h"
#include "P4_0_aliases.h"
#include "P4_0.h"
#include "P4_1_aliases.h"
#include "P4_1.h"
#include "P6_5_aliases.h"
#include "P6_5.h"
#include "P1_6_aliases.h"
#include "P1_6.h"
#include "P1_7_aliases.h"
#include "P1_7.h"
#include "LCD_LCDPort_aliases.h"
#include "LCD_LCDPort.h"
#include "QuadDec_1_Cnt8.h"
#include "ADC_SAR_1_IRQ.h"
#include "ADC_SAR_1_theACLK.h"
#include "ADC_SAR_1_Bypass_aliases.h"
#include "ADC_SAR_1_Bypass.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

